---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsGenericFailure
source: html/31ebb4c8-d9a5-3031-7dba-103c5d911a90.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsGenericFailure Property

Stairs generic failure

## Syntax (C#)
```csharp
public static FailureDefinitionId StairsGenericFailure { get; }
```